# Результат сложения или вычитания целых чисел
num_int1 = 10
num_int2 = 5
result_int = num_int1 + num_int2
print("Результат сложения целых чисел:", result_int)

# Результат сложения или вычитания чисел с плавающей точкой
num_float1 = 3.5
num_float2 = 1.2
result_float = num_float1 - num_float2
print("Результат вычитания чисел с плавающей точкой:", result_float)

# Результат сложения или вычитания целого числа и числа с плавающей точкой
result_mix = num_int1 + num_float2
print("Результат сложения целого числа и числа с плавающей точкой:", result_mix)