# 10) Задача: Замена символов в строке

# Исходная строка
original_string = "python programming"

# Заменяем символ 'p' на 'P', 'o' на 'O', 'g' на 'G'
modified_string = original_string.replace('p', 'P').replace('o', 'O').replace('g', 'G')

print(f"Исходная строка: {original_string}")
print(f"Измененная строка: {modified_string}")